#******************************************************************************
#
#    ＊ テストマップ
#
#  --------------------------------------------------------------------------
#    バージョン ： 1.0.0
#    対      応 ： RPGツクールVX Ace : RGSS3
#    制  作  者 ： ＣＡＣＡＯ
#    配  布  元 ： https://cacaosoft.mars.jp/
#  --------------------------------------------------------------------------
#   == 概    要 ==
#
#    ： テストマップへ場所移動する機能を追加します。
#
#  --------------------------------------------------------------------------
#   == 使用方法 ==
#
#    ★ テストマップへ移動
#     マップ画面で F7 キーを押すと場所移動します。
#
#
#******************************************************************************


#==============================================================================
# ◆ 設定項目
#==============================================================================
module CAO
  module TestMap
    #--------------------------------------------------------------------------
    # ◇ テストマップのＩＤ
    #--------------------------------------------------------------------------
    MAP_ID = 2
    #--------------------------------------------------------------------------
    # ◇ 移動先の座標
    #--------------------------------------------------------------------------
    PLAYER_POSITION = [0, 0]
    #--------------------------------------------------------------------------
    # ◇ ボタン設定
    #--------------------------------------------------------------------------
    KEY = :F7
  end # module TestMap
  end # module CAO


  #/////////////////////////////////////////////////////////////////////////////#
  #                                                                             #
  #                下記のスクリプトを変更する必要はありません。                 #
  #                                                                             #
  #/////////////////////////////////////////////////////////////////////////////#


  if $TEST

  class Game_Player < Game_Character
    #--------------------------------------------------------------------------
    # ●
    #--------------------------------------------------------------------------
    def clear_testmap_info
      @testmap_info = nil
    end
    #--------------------------------------------------------------------------
    # ●
    #--------------------------------------------------------------------------
    def testmap_transfer
      if $game_map.map_id == CAO::TestMap::MAP_ID
        return unless @testmap_info
        map_id, x, y, direction = @testmap_info
      else
        @testmap_info = [$game_map.map_id, @x, @y, @direction]
        map_id = CAO::TestMap::MAP_ID
        x, y, direction = *CAO::TestMap::PLAYER_POSITION, 2
      end
      reserve_transfer(map_id, x, y, direction)
    end
  end

  class Scene_Map < Scene_Base
    #--------------------------------------------------------------------------
    # ● F9 キーによるデバッグ呼び出し判定
    #--------------------------------------------------------------------------
    alias _cao_testmap_update_call_debug update_call_debug
    def update_call_debug
      _cao_testmap_update_call_debug
      return unless Input.press?(CAO::TestMap::KEY)
      return if $game_map.interpreter.running?
      $game_player.testmap_transfer
      $game_temp.fade_type = 0
    end
    #--------------------------------------------------------------------------
    # ● 場所移動の処理
    #--------------------------------------------------------------------------
    alias _cao_testmap_perform_transfer perform_transfer
    def perform_transfer
      last_map_id = $game_map.map_id
      _cao_testmap_perform_transfer
      if last_map_id == CAO::TestMap::MAP_ID && last_map_id != $game_map.map_id
        $game_player.clear_testmap_info
      end
    end
  end

  end # if $TEST
