#******************************************************************************
#
#    ＊ 所持金ウィンドウ
#
#  --------------------------------------------------------------------------
#    バージョン ： 1.1.1
#    対      応 ： RPGツクールVX Ace : RGSS3
#    制  作  者 ： ＣＡＣＡＯ
#    配  布  元 ： http://cacaosoft.webcrow.jp/
#  --------------------------------------------------------------------------
#   == 概    要 ==
#
#    ： 所持金を表示するウィンドウを追加します。
#
#  --------------------------------------------------------------------------
#   == 注意事項 ==
#
#    ※ このスクリプトの動作には、Custom Menu Base が必要です。
#
#
#******************************************************************************


#==============================================================================
# ◆ 設定項目
#==============================================================================
module CAO::CM::Gold
  #--------------------------------------------------------------------------
  # ◇ ウィンドウの位置とサイズ
  #--------------------------------------------------------------------------
  WINDOW_X = 0      # ｘ座標
  WINDOW_Y = 368    # ｙ座標
  WINDOW_W = 160    # 横幅
  #--------------------------------------------------------------------------
  # ◇ 所持金の名前
  #--------------------------------------------------------------------------
  VOCAB_GOLD = nil
  #--------------------------------------------------------------------------
  # ◇ アイコンの番号
  #--------------------------------------------------------------------------
  ICON_INDEX = nil
  #--------------------------------------------------------------------------
  # ◇ 通貨単位の有無
  #--------------------------------------------------------------------------
  VISIBLE_SYSTEM = true
  #--------------------------------------------------------------------------
  # ◇ ウィンドウの可視状態
  #--------------------------------------------------------------------------
  VISIBLE_BACKWINDOW = true
end


#/////////////////////////////////////////////////////////////////////////////#
#                                                                             #
#                下記のスクリプトを変更する必要はありません。                 #
#                                                                             #
#/////////////////////////////////////////////////////////////////////////////#


class Window_MenuGold < Window_Gold
  include CAO::CM::Gold
  #--------------------------------------------------------------------------
  # ○ ウィンドウ幅の取得
  #--------------------------------------------------------------------------
  def window_width
    return WINDOW_W
  end
  #--------------------------------------------------------------------------
  # ○ 通貨単位つき数値（所持金など）の描画
  #--------------------------------------------------------------------------
  def draw_currency_value(value, unit, x, y, width)
    if ICON_INDEX
      draw_icon(ICON_INDEX, x, y + (line_height - 24) / 2)
      x += 24
      width -= 24
    end
    cx = 0
    if VISIBLE_SYSTEM
      cx = text_size(unit).width
      change_color(system_color)
      draw_text(x, y, width, line_height, VOCAB_GOLD) if VOCAB_GOLD
      draw_text(x, y, width, line_height, unit, 2)
    end
    change_color(normal_color)
    draw_text(x, y, width - cx - 2, line_height, value, 2)
  end
end

class Scene_Menu
  #--------------------------------------------------------------------------
  # ○ オプションウィンドウの作成
  #--------------------------------------------------------------------------
  alias _cao_cm_gold_create_option_window create_option_window
  def create_option_window
    _cao_cm_gold_create_option_window
    create_gold_window
  end
  #--------------------------------------------------------------------------
  # ○ ゴールドウィンドウの作成
  #--------------------------------------------------------------------------
  def create_gold_window
    @gold_window = Window_MenuGold.new
    @gold_window.x = CAO::CM::Gold::WINDOW_X
    @gold_window.y = CAO::CM::Gold::WINDOW_Y
    @gold_window.opacity = CAO::CM::Gold::VISIBLE_BACKWINDOW ? 255 : 0
  end
  #--------------------------------------------------------------------------
  # ○ コマンド実行後の処理
  #--------------------------------------------------------------------------
  alias _cao_cm_gold_post_terminate post_terminate
  def post_terminate
    _cao_cm_gold_post_terminate
    if current_console.current_data.refresh_items.include?(:gold)
      @gold_window.refresh
    end
  end
end
